Repository: Kaletsidikk/kalnet
Catalog: website/translations/*/LC_MESSAGES/messages.po
Languages: am

source: Home
am: ቤት

source: Services
am: አገልግሎቶች

source: Order
am: ትዕዛዝ

source: Schedule
am: ፕሮግራም

source: Contact
am: ግንኙነት

source: Channel
am: ቻናል

source: Professional Printing Services
am: ፕሮፌሽናል የህትመት አገልግሎቶች

source: Quality printing solutions for your business needs
am: ለንግድ ፍላጎትዎ የጥራት ህትመት መፍትሄዎች

source: From business cards to large format printing, we deliver exceptional quality and fast turnaround times.
am: ከንግድ ካርዶች እስከ ትላቅ ፎርማት ህትመት፣ እጅግ የላቀ ጥራትና ፈጣን አገልግሎት እንሰጣለን።

source: Why Choose Us?
am: ለምን እኛን መርጠው?

source: We deliver excellence in every print job
am: በእያንዳንዱ የህትመት ሥራ ላይ ምርጥነትን እናቀርባለን

source: Quality Printing
am: የጥራት ህትመት

source: State-of-the-art equipment for professional results
am: ለፕሮፌሽናል ውጤት ዘመናዊ መሳሪያዎች

source: Fast Turnaround
am: ፈጣን አገልግሎት

source: Quick delivery without compromising on quality
am: ጥራትን ሳይጎዳ ፈጣን አቅርቦት

source: Competitive Pricing
am: ተወዳዳሪ ዋጋ

source: Affordable rates for all printing services
am: ለሁሉም የህትመት አገልግሎቶች ተመጣጣኝ ዋጋ

source: Custom Design
am: ብጁ ዲዛይን

source: Professional design services available
am: ፕሮፌሽናል የዲዛይን አገልግሎቶች አሉ

source: Our Services
am: የእኛ አገልግሎቶች

source: We offer a wide range of printing services to meet all your business needs.
am: ሁሉንም የንግድ ፍላጎቶችዎን ለማሟላት ሰፊ የህትመት አገልግሎቶችን እናቀርባለን።

source: View All Services
am: ሁሉንም አገልግሎቶች ይመልከቱ

source: Ready to Get Started?
am: ለመጀመር ተዘጋጅተዋል?

source: Get your printing project started today with our professional services.
am: የህትመት ፕሮጀክትዎን ዛሬ በእኛ ፕሮፌሽናል አገልግሎት ይጀምሩ።

source: Order Now
am: አሁን ይዘዙ

source: Contact Us
am: ያግኙን

source: Order via Telegram Bot
am: በቴሌግራም ቦት ይዘዙ

source: You can also place orders, schedule consultations, and message us directly through our Telegram bot for a convenient mobile experience.
am: እንዲሁም በቴሌግራም ቦታችን በኩል ትዕዛዞችን መስጠት፣ ምክክር መፈጸም እና በቀጥታ መልዕክት መላክ ይችላሉ።

source: Quick order placement
am: ፈጣን የትዕዛዝ አቀራረብ

source: Easy consultation scheduling
am: ቀላል የምክክር መርሐ ግብር

source: Direct messaging support
am: የቀጥታ መልዕክት ድጋፍ

source: Real-time notifications
am: በእውነተኛ ጊዜ ማሳወቂያዎች

source: Search for our bot on Telegram:
am: በቴሌግራም ውስጥ የእኛን ቦት ይፈልጉ፡

source: Start Bot
am: ቦት ይጀምሩ

source: Stay Updated!
am: ወቅታዊ ይሁኑ!

source: Join our Telegram channel for the latest updates, promotions, and printing tips.
am: ለዘመናዊ መረጃዎች፣ ወቅታዊ ስጦታዎች እና የህትመት ምክሮች የቴሌግራም ቻናላችንን ይቀላቀሉ።

source: Place Order
am: ትዕዛዝ ይስጡ

source: Schedule Consultation
am: ምክክር ያዘጋጁ
